[
    {
        "id": 0,
        "identifier": "H.J.Res.26",
        "title": "Disapproving the action of the District of Columbia Council in approving the Revised Criminal Code Act of 2022.",
        "description": "Bill to protect an individual's ability to access contraceptives and protect a health care provider's ability to provide them.",
        "state": "US",
        "body": "House",
        "session": "2024",
        "tags": ["Government Operations", "Congressional Oversight", "Criminal Procedure", "District of Columbia", "Due Process", "Local Government"],
        "briefing": "This joint resolution nullifies the Revised Criminal Code Act of 2022, enacted by the council of the District of Columbia (DC). The act makes a variety of changes to DC criminal laws, including by providing statutory definitions for various elements of criminal offenses, modifying sentencing guidelines and penalties, and expanding the right to a jury trial for certain misdemeanor crimes.",
        "sponsorIds": [101],
        "status": "Became Law",
        "latestAction": "Became Public Law No: 118-1",
        "yesVotes": 15,
        "noVotes": 2,
        "userVote": null
    },
    {
        "id": 1,
        "identifier": "S.4802",
        "title": "Department of the Interior, Environment, and Related Agencies Appropriations Act, 2025",
        "description": "This bill provides FY2025 appropriations for the Department of the Interior, the Environmental Protection Agency (EPA), and several related agencies.",
        "state": "US",
        "body": "Senate",
        "session": "2024",
        "tags": ["Appropriations"],
        "briefing": "Making appropriations for the Department of the Interior, environment, and related agencies for the fiscal year ending September 30, 2025, and for other purposes. Additionally, the bill sets forth requirements and restrictions for using funds provided by this and other appropriations acts.",
        "sponsorIds": [72],
        "latestAction": "Senate - 07/25/2024 Placed on Senate Legislative Calendar under General Orders. Calendar No. 447.",
        "status": "Introduced",
        "yesVotes": 34,
        "noVotes": 18,
        "userVote": null
    },
    {
        "id": 2,
        "identifier": "S.4361",
        "title": "Border Act of 2024",
        "description": "The bill expands Department of Homeland Security (DHS) authority to address the processing of non-U.S. nationals and provides supplemental appropriations for related purposes.",
        "state": "US",
        "body": "Senate",
        "session": "2024",
        "tags": ["Immigration", "Appropriations", "Border Security", "Smuggling and Trafficking", "Law Enforcement", "Citizenship"],
        "briefing": "Among other provisions, the bill provides DHS emergency authority to summarily remove or prohibit the entry of certain non-U.S. nationals within 100 miles of the southwest land border. DHS may exercise this authority if DHS encounters an average of 4,000 non-U.S. nationals within a seven-day period. If the number of encounters reach certain higher thresholds, DHS must exercise the emergency authority. This emergency border authority expires after three years and may be modified by the President under specified circumstances. Next, the bill establishes an expedited process that authorizes asylum officers to adjudicate certain asylum claims. Among other provisions, these provisional noncustodial removal proceedings impose certain target timelines for determining asylum claims and limit review of denied claims. The bill also establishes a stricter threshold for individuals to remain in the United States pending adjudication of an asylum petition. The bill extends and establishes immigration pathways for Afghan citizens or nationals, including by (1) making certain individuals admitted or paroled to the United States eligible for conditional permanent resident status, and (2) expanding eligibility for special immigrant visas for certain individuals who were injured while supporting the U.S. mission in Afghanistan. The bill also increases base pay for asylum officers and grants DHS temporary direct hire authority to hire personnel to implement the bill.",
        "sponsorIds": [13],
        "status": "Passed Senate",
        "latestAction": "Senate - 05/23/2024 Cloture on the motion to proceed to the measure not invoked in Senate by Yea-Nay Vote. 43 - 50. Record Vote Number: 182. (CR S3878)",
        "yesVotes": 325,
        "noVotes": 41,
        "userVote": null
    },
    {
        "id": 3,
        "identifier": "S.4381",
        "title": "Right to Contraception Act",
        "description": "Bill to protect an individual's ability to access contraceptives and protect a health care provider's ability to provide them.",
        "state": "US",
        "body": "Senate",
        "session": "2024",
        "tags": ["Healthcare", "Contraception"],
        "briefing": "The Right to Contraception Act ensures individuals' rights to access contraceptives and contraception-related services, while protecting healthcare providers' ability to offer these services without restrictions. It prohibits any government from enacting laws or regulations that limit access to contraception or target providers, and overrides conflicting state or federal laws. The Act allows both the Attorney General and individuals to challenge violations through legal action, with courts empowered to provide equitable relief and cover legal costs for plaintiffs.",
        "sponsorIds": [40],
        "status": "Passed Senate",
        "latestAction": "Senate - 06/05/2024 Motion to table the motion to proceed to the measure agreed to in Senate by Voice Vote.",
        "yesVotes": 201,
        "noVotes": 89,
        "userVote": null
    }
]